; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-3degree-100mindistance-3trucks-5packages-1107seed

(define (problem transport-two-cities-sequential-5nodes-1000size-3degree-100mindistance-3trucks-5packages-1107seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 431,323 -> 678,784
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 53)
  ; 678,784 -> 431,323
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 53)
  ; 431,323 -> 800,143
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 42)
  ; 800,143 -> 431,323
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 42)
  ; 717,538 -> 678,784
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 25)
  ; 678,784 -> 717,538
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 25)
  ; 717,538 -> 800,143
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 41)
  ; 800,143 -> 717,538
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 41)
  ; 717,538 -> 431,323
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 36)
  ; 431,323 -> 717,538
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 36)
  ; 690,163 -> 800,143
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 12)
  ; 800,143 -> 690,163
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 12)
  ; 690,163 -> 431,323
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 31)
  ; 431,323 -> 690,163
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 31)
  ; 690,163 -> 717,538
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 38)
  ; 717,538 -> 690,163
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 38)
  ; 2270,339 -> 2702,386
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 44)
  ; 2702,386 -> 2270,339
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 44)
  ; 2270,339 -> 2179,58
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 30)
  ; 2179,58 -> 2270,339
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 30)
  ; 2270,339 -> 2283,735
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 40)
  ; 2283,735 -> 2270,339
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 40)
  ; 2319,47 -> 2702,386
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 52)
  ; 2702,386 -> 2319,47
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 52)
  ; 2319,47 -> 2179,58
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 14)
  ; 2179,58 -> 2319,47
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 14)
  ; 2319,47 -> 2270,339
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 30)
  ; 2270,339 -> 2319,47
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 30)
  ; 800,143 <-> 2179,58
  (road city-1-loc-2 city-2-loc-2)
  (= (road-length city-1-loc-2 city-2-loc-2) 139)
  (road city-2-loc-2 city-1-loc-2)
  (= (road-length city-2-loc-2 city-1-loc-2) 139)
  (at package-1 city-1-loc-1)
  (at package-2 city-1-loc-3)
  (at package-3 city-1-loc-3)
  (at package-4 city-1-loc-3)
  (at package-5 city-1-loc-2)
  (at truck-1 city-2-loc-4)
  (capacity truck-1 capacity-4)
  (at truck-2 city-2-loc-5)
  (capacity truck-2 capacity-4)
  (at truck-3 city-2-loc-2)
  (capacity truck-3 capacity-4)
 )
 (:goal (and
  (at package-1 city-2-loc-4)
  (at package-2 city-2-loc-4)
  (at package-3 city-2-loc-5)
  (at package-4 city-2-loc-3)
  (at package-5 city-2-loc-3)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-3 city-2-loc-2 city-1-loc-2)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-1-loc-2)
   goals met: 0 of 5
2. (drive truck-3 city-1-loc-2 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 5
3. (pick-up truck-3 city-1-loc-3 package-4 capacity-3 capacity-4)
   deleted: (at package-4 city-1-loc-3) (capacity truck-3 capacity-4)
   added: (in package-4 truck-3) (capacity truck-3 capacity-3)
   goals met: 0 of 5
4. (pick-up truck-3 city-1-loc-3 package-3 capacity-2 capacity-3)
   deleted: (at package-3 city-1-loc-3) (capacity truck-3 capacity-3)
   added: (in package-3 truck-3) (capacity truck-3 capacity-2)
   goals met: 0 of 5
5. (pick-up truck-3 city-1-loc-3 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-3) (capacity truck-3 capacity-2)
   added: (in package-2 truck-3) (capacity truck-3 capacity-1)
   goals met: 0 of 5
6. (drive truck-3 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-1)
   goals met: 0 of 5
7. (pick-up truck-3 city-1-loc-1 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-1-loc-1) (capacity truck-3 capacity-1)
   added: (in package-1 truck-3) (capacity truck-3 capacity-0)
   goals met: 0 of 5
8. (drive truck-3 city-1-loc-1 city-1-loc-3)
   deleted: (at truck-3 city-1-loc-1)
   added: (at truck-3 city-1-loc-3)
   goals met: 0 of 5
9. (drive truck-3 city-1-loc-3 city-1-loc-2)
   deleted: (at truck-3 city-1-loc-3)
   added: (at truck-3 city-1-loc-2)
   goals met: 0 of 5
10. (drive truck-3 city-1-loc-2 city-2-loc-2)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-2-loc-2)
   goals met: 0 of 5
11. (drive truck-3 city-2-loc-2 city-2-loc-5)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-2-loc-5)
   goals met: 0 of 5
12. (drop truck-3 city-2-loc-5 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-3) (capacity truck-3 capacity-0)
   added: (at package-3 city-2-loc-5) (capacity truck-3 capacity-1)
   goals met: 1 of 5
13. (drive truck-3 city-2-loc-5 city-2-loc-2)
   deleted: (at truck-3 city-2-loc-5)
   added: (at truck-3 city-2-loc-2)
   goals met: 1 of 5
14. (drive truck-3 city-2-loc-2 city-1-loc-2)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-1-loc-2)
   goals met: 1 of 5
15. (pick-up truck-3 city-1-loc-2 package-5 capacity-0 capacity-1)
   deleted: (at package-5 city-1-loc-2) (capacity truck-3 capacity-1)
   added: (in package-5 truck-3) (capacity truck-3 capacity-0)
   goals met: 1 of 5
16. (drive truck-3 city-1-loc-2 city-2-loc-2)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-2-loc-2)
   goals met: 1 of 5
17. (drive truck-3 city-2-loc-2 city-2-loc-4)
   deleted: (at truck-3 city-2-loc-2)
   added: (at truck-3 city-2-loc-4)
   goals met: 1 of 5
18. (drop truck-3 city-2-loc-4 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-0)
   added: (at package-1 city-2-loc-4) (capacity truck-3 capacity-1)
   goals met: 2 of 5
19. (drop truck-3 city-2-loc-4 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-3) (capacity truck-3 capacity-1)
   added: (at package-2 city-2-loc-4) (capacity truck-3 capacity-2)
   goals met: 3 of 5
20. (drive truck-3 city-2-loc-4 city-2-loc-3)
   deleted: (at truck-3 city-2-loc-4)
   added: (at truck-3 city-2-loc-3)
   goals met: 3 of 5
21. (drop truck-3 city-2-loc-3 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-3) (capacity truck-3 capacity-2)
   added: (at package-4 city-2-loc-3) (capacity truck-3 capacity-3)
   goals met: 4 of 5
22. (drop truck-3 city-2-loc-3 package-5 capacity-3 capacity-4)
   deleted: (in package-5 truck-3) (capacity truck-3 capacity-3)
   added: (at package-5 city-2-loc-3) (capacity truck-3 capacity-4)
   goals met: 5 of 5
